episode-07/app/controllers/api/consoles_controller.rb

  def index
    if params[:manufacturer].present?
      consoles = Console.where(manufacturer: params[:manufacturer])
    else
      consoles = Console.all
    end

    render(json: { "consoles" => consoles.map(&:formatted_name) })
---
SELECT "consoles".* FROM "consoles" WHERE "consoles"."manufacturer" = ?  [["manufacturer", "Nintendo"]]
SELECT "consoles".* FROM "consoles"