episode-05/app/controllers/consoles_controller.rb

SELECT "consoles".* FROM "consoles" WHERE "consoles"."manufacturer" = ?  [["manufacturer", "Nintendo"]]
SELECT "consoles".* FROM "consoles"
---
  def index
    if params[:manufacturer].present?
      consoles = Console.where(manufacturer: params[:manufacturer])
    else
      consoles = Console.all